dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_OFF (8u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_OFF (9u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_LEN (5u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_MSK (0x1fu)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_OFF (11u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_LEN (5u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_MSK (0x1fu)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_OFF (16u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_OFF (21u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_OFF (22u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_OFF (23u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_OFF (24u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_OFF (25u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_OFF (26u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_OFF (27u)

/** \brief Length for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_LEN (21u)

/** \brief Mask for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_MSK (0x1fffffu)

/** \brief Offset for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_OFF (0u)

/** \brief Length for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_LEN (4u)

/** \brief Mask for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_OFF (24u)

/** \brief Length for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_LEN (4u)

/** \brief Mask for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_OFF (0u)

/** \brief Length for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_LEN (4u)

/** \brief Mask for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_OFF (4u)

/** \brief Length for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_LEN (4u)

/** \brief Mask for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_OFF (0u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_LEN (4u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_OFF (0u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_LEN (7u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_OFF (4u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_LEN (2u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_OFF (12u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_LEN (2u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_OFF (14u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_LEN (9u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_MSK (0x1ffu)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_OFF (16u)

/** \brief Length for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_LEN (6u)

/** \brief Mask for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_OFF (26u)

/** \brief Length for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_LEN (6u)

/** \brief Mask for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_OFF (0u)

/** \brief Length for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_LEN (6u)

