dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_OFF (29u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_OFF (30u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_OFF (31u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_OFF (0u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_OFF (1u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_OFF (2u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_OFF (3u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_OFF (4u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_OFF (5u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_OFF (6u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_OFF (7u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_OFF (8u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_OFF (9u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_OFF (10u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_OFF (11u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_OFF (12u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_OFF (13u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_OFF (14u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_OFF (15u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_OFF (16u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_OFF (17u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_OFF (18u)

/** \brief Length for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_MSK (0x1u)

